{"translation-revision-date":"2024-07-02 11:26:49+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n != 1;","lang":"es"},"Credit Card":["Tarjeta de crédito"],"Button Type":["Tipo de botón"],"Both":["Ambos"],"Save to Log":["Guardar en el registro"],"Show on Checkout Page":["Mostrar en la página de finalizar compra"],"Off":["Desconectado"],"Debug Mode":["Modo de depuración"],"Advanced Settings":["Ajustes avanzados"],"Google Pay Button Color":["Color del botón de Google Pay"],"Apple Pay Button Color":["Color del botón de Apple Pay"],"Check to enable tokenization and allow customers to securely save their payment details for future checkout.":["Comprueba que se permite la tokenización y permite a los clientes guardar de forma segura sus datos de pago para futuras compras."],"Detailed Decline Messages":["Mensajes de rechazo detallados"],"Hide Digital Wallet Buttons":["Ocultar botones de cartera digital"],"Allow customers to pay with Apple Pay or Google Pay from your Product, Cart and Checkout pages. Read more about the availablity of digital wallets in our %1$sdocumentation%2$s.":["Permite a los clientes pagar con Apple Pay o Google Pay desde tus páginas de producto, carrito y finalizar compra. Lee más sobre la disponibilidad de carteras digitales en nuestra %1$sdocumentación%2$s."],"Update existing products during import.":["Actualizar los productos existentes durante la importación."],"Doing so will update existing WooCommerce products with the latest information from Square. %1$sView Documentation%2$s.":["Al hacerlo así se actualizarán los productos existentes en WooCommerce con la última información de Square. %1$sVer documentación%2$s."],"Do you wish to import existing product updates from Square?":["¿Quieres importar las actualizaciones de productos existentes de Square?"],"You are about to import all new products, variations and categories from Square. This will create a new product in WooCommerce for every product retrieved from Square. If you have products in the trash from the previous imports, these will be ignored in the import.":["Estás a punto de importar todos los nuevos productos, variaciones y categorías de Square. Esto creará un nuevo producto en WooCommerce para cada producto obtenido desde Square. Si tienes productos en la papelera de importaciones anteriores se ignorarán en la importación."],"Enable Sandbox Mode":["Activar el modo de pruebas"],"After enabling you'll see a new Sandbox settings section with two fields: Sandbox Application ID & Sandbox Access Token.":["Después de activarlo, verás una nueva sección de ajustes del entorno de pruebas con dos campos: ID de aplicación del entorno de pruebas y token de acceso al entorno de pruebas."],"Sandbox Access Token":["Token de acceso al entorno de pruebas"],"Sandbox Application ID":["ID de aplicación en modo de pruebas"],"Application ID for the Sandbox Application, see the details in the %1$sMy Applications%2$s section.":["ID de aplicación de la aplicación en entorno de pruebas, mira los detalles en la sección «%1$sMis aplicaciones%2$s»."],"Access Token for the Sandbox Test Account, see the details in the %1$sSandbox Test Account%2$s section. Make sure you use the correct Sandbox Access Token for your application. For a given Sandbox Test Account, each Authorized Application is assigned a different Access Token.":["Token de acceso para la cuenta del entorno de pruebas, mira los detalles en la sección del %1$sentorno de pruebas de la cuenta%2$s. Asegúrate de usar el token de acceso al entorno de pruebas correcto para tu aplicación. Se asigna un token de acceso distinto para cada aplicación autorizada en cada cuenta de entorno de pruebas."],"Inventory is %1$salways fetched from Square%2$s periodically to account for sales from other channels.":["El inventario %1$ssiempre se obtiene de Square%2$s periódicamente para contabilizar las ventas de otros canales."],"Enable to push inventory changes to Square":["Actívalo para enviar los cambios de inventario a Square"],"Enable to fetch inventory changes from Square":["Actívalo para obtener los cambios de inventario de Square"],"Please choose a location":["Por favor, elige una ubicación"],"Connection":["Conexión"],"Customer Profiles":["Perfiles de clientes"],"Log debug messages to the %1$sWooCommerce status log%2$s":["Registrar mensajes de depuración en el %1$sreegistro de estados de WooCommerce%2$s"],"Products not found in Square will be hidden in the WooCommerce product catalog.":["Los productos que no se encuentren en Square se ocultarán del catálogo de productos de WooCommerce."],"Hide synced products when not found in Square":["Ocultar los productos sincronizados cuando no se encuentren en Square"],"Handle missing products":["Gestionar productos que falten"],"Import Products":["Importar productos"],"Cancel":["Cancelar"],"Enable Logging":["Activar registro"],"WooCommerce":["WooCommerce"],"Description":["Descripción"],"Title":["Título"],"Enable \/ Disable":["Activar \/ Desactivar"],"Disconnect from Square":["Desconectar de Square"],"Business location":["Ubicación del negocio"],"Square":["Square"]}},"comment":{"reference":"build\/settings.js"}}